#+title: selected-window-accent-mode
#+author: James Dyer
#+email: captainflasmr@gmail.com
#+language: en
#+options: ':t toc:nil author:nil email:nil num:nil title:nil
#+todo: TODO DOING | DONE
#+startup: showall

* Customization

#+begin_src emacs-lisp :results table :colnames '("Custom variable" "Description") :exports results
  (let ((rows))
    (mapatoms
     (lambda (symbol)
       (when (and (string-match "^selected-window-accent-"
                                (symbol-name symbol))
                  (not (string-match "--" (symbol-name symbol)))
                  (or (custom-variable-p symbol)
                      (boundp symbol)))
         (push `(,symbol
                 ,(car
                   (split-string
                    (or (get (indirect-variable symbol)
                             'variable-documentation)
                        (get symbol 'variable-documentation)
                        "")
                    "\n")))
               rows))))
    rows)
#+end_src

#+RESULTS:
| Custom variable                                 | Description                                                                     |
|-------------------------------------------------+---------------------------------------------------------------------------------|
| selected-window-accent-foreground-adjust-factor | Adjustment factor for incrementing or decrementing foreground color brightness. |
| selected-window-accent-mode-style               | Current style for accenting the selected window.                                |
| selected-window-accent-percentage-darken        | The percentage the highlight accent is darkened.                                |
| selected-window-accent-use-blend-background     | When non-nil, use the accent color to blend with background of selected window. |
| selected-window-accent-use-pywal                | When non-nil, use a color from Pywal generated palette.                         |
| selected-window-accent-smart-borders            | When non-nil, the `selected-window-accent-smart-borders` is active.             |
| selected-window-accent-fg-color                 | Custom foreground accent color for the selected window.                         |
| selected-window-accent-custom-color             | Custom accent color for the selected window.                                    |
| selected-window-accent-percentage-desaturate    | The percentage the highlight accent is saturated.                               |
| selected-window-accent-mode                     | Non-nil if Selected-Window-Accent mode is enabled.                              |
| selected-window-accent-use-blend-alpha          | Adjustment alpha factor for background of selected window blending              |
| selected-window-accent-tab-accent               | When non-nil, the `selected-window-accent-tab-accent` is active.                |
| selected-window-accent-mode-hook                | Hook run after entering or leaving `selected-window-accent-mode'.               |
| selected-window-accent-fringe-thickness         | The thickness of the fringes in pixels.                                         |

* Commands

#+BEGIN_SRC emacs-lisp :results table :colnames '("Command" "Description") :exports results
    (let ((rows))
      (mapatoms
       (lambda (symbol)
         (when (and (string-match "^selected-window-accent-"
                                  (symbol-name symbol))
                    (commandp symbol))
           (push `(,(string-join
                     (seq-filter
                      (lambda (symbol)
                        (not (string-match "menu" symbol)))
                      (mapcar
                       (lambda (keys)
                         (key-description keys))
                       (or
                        (where-is-internal
                         (symbol-function symbol)
                         comint-mode-map
                         nil nil (command-remapping 'comint-next-input))
                        (where-is-internal
                         symbol ready-player-major-mode-map nil nil (command-remapping symbol))
                        (where-is-internal
                         (symbol-function symbol)
                         ready-player-major-mode-map nil nil (command-remapping symbol)))))  " or ")
                   ,(symbol-name symbol)
                   ,(car
                     (split-string
                      (or (documentation symbol t) "")
                      "\n")))
                 rows))))
      rows)
#+END_SRC

#+RESULTS:
|       | selected-window-accent--reset-window-accent                   | Reset the accent colors for all windows to their defaults.                       |
|       | selected-window-accent-switch-selected-window-accent-style    | Switch the selected window accent style to STYLE and apply it.                   |
|       | selected-window-accent-increment-foreground-color             | Increment the foreground color brightness.  With ARG, adjust by a larger factor. |
|       | selected-window-accent-decrement-foreground-color             | Decrement the foreground color brightness.  With ARG, adjust by a larger factor. |
|       | selected-window-accent-flip-foreground-color                  | Flip the current foreground color to its opposite value.                         |
|       | selected-window-accent-output-selected-window-accent-settings | Output current `selected-window-accent-mode' settings to a new buffer.           |
| C-c w | selected-window-accent-transient                              | Transient for selected window accent.                                            |
|       | selected-window-accent-toggle-tab-accent                      | Toggle between showing the tab accent.                                           |
| C-q a | selected-window-accent-mode                                   | Toggle selected window accenting.                                                |
|       | selected-window-accent-toggle-pywal                           | Toggle between pywal.                                                            |
|       | selected-window-accent-toggle-blend-background                | Toggle between blend background.                                                 |
|       | selected-window-accent-toggle-smart-borders                   | Toggle between smart borders.                                                    |
|       | selected-window-accent-toggle-complementary-color             | Toggle between complementary color for foreground based on background color.     |


